Repository: YunaBraska/Sentrio
Catalog: Sources/SentrioCore/Resources/*.lproj/Localizable.strings
Languages: fr, sv

# label.output
source: Output
fr: Sortie
sv: Ut

# label.input
source: Input
fr: Entrée
sv: In

# label.alert
source: Alert
fr: Alerte
sv: Varning

# label.general
source: General
fr: Général
sv: Allmänt

# label.inputGain
source: Input Gain
fr: Gain d’entrée
sv: Ingångsförstärkning

# action.preferences
source: Preferences…
fr: Préférences…
sv: Inställningar…

# action.soundSettings
source: Sound Settings…
fr: Réglages audio…
sv: Ljudinställningar…

# action.bluetoothSettings
source: Bluetooth Settings…
fr: Réglages Bluetooth…
sv: Bluetooth-inställningar…

# action.quit
source: Quit
fr: Quitter
sv: Avsluta

# action.playSound
source: Play sound
fr: Lire le son
sv: Spela upp ljud

# action.disableDevice
source: Disable Device
fr: Désactiver l’appareil
sv: Inaktivera enhet

# action.enable
source: Enable
fr: Activer
sv: Aktivera

# action.reset
source: Reset
fr: Réinitialiser
sv: Återställ

# action.resetToDefault
source: Reset to default
fr: Réinitialiser par défaut
sv: Återställ till standard

# action.rename
source: Rename
fr: Renommer
sv: Byt namn

# action.cancel
source: Cancel
fr: Annuler
sv: Avbryt

# action.save
source: Save
fr: Enregistrer
sv: Spara

# action.chooseIcon
source: Choose Icon
fr: Choisir une icône
sv: Välj ikon

# action.setIcon
source: Set Icon…
fr: Définir l’icône…
sv: Ange ikon…

# action.openSoundSettings
source: Open Sound Settings…
fr: Ouvrir les réglages audio…
sv: Öppna ljudinställningar…

# action.exportSettings
source: Export Settings…
fr: Exporter les réglages…
sv: Exportera inställningar…

# action.importSettings
source: Import Settings…
fr: Importer les réglages…
sv: Importera inställningar…

# action.showInFinder
source: Show in Finder
fr: Afficher dans le Finder
sv: Visa i Finder

# action.clearVolumeMemory
source: Clear Volume Memory
fr: Effacer la mémoire des volumes
sv: Rensa volymminne

# action.viewSourceOnGitHub
source: View Source on GitHub
fr: Voir le code sur GitHub
sv: Visa källkod på GitHub

# action.buyMeCoffee
source: ☕ Buy Me a Coffee
fr: ☕ M’offrir un café
sv: ☕ Bjud mig på kaffe

# action.reportIssue
source: Report an Issue
fr: Signaler un problème
sv: Rapportera ett problem

# status.connected
source: Connected
fr: Connecté
sv: Ansluten

# status.disconnected
source: Disconnected
fr: Déconnecté
sv: Frånkopplad

# status.exportedSettings
source: Exported settings.
fr: Réglages exportés.
sv: Inställningar exporterade.

# status.importedSettings
source: Imported settings.
fr: Réglages importés.
sv: Inställningar importerade.

# error.exportFailedFormat
source: Export failed: %@
fr: Échec de l’export : %@
sv: Export misslyckades: %@

# error.importFailedFormat
source: Import failed: %@
fr: Échec de l’import : %@
sv: Import misslyckades: %@

# menu.autoHelp
source: Automatically switch devices based on priority rules
fr: Basculer automatiquement les appareils selon les règles de priorité
sv: Växla enheter automatiskt enligt prioriteringsregler

# menu.noDevices
source: Silence detected. How… peaceful.
fr: Silence détecté. Quelle… paix.
sv: Tystnad upptäckt. Så… fridfullt.

# menu.deviceRow.autoModeHelp
source: Auto-switch is on — turn it off to select manually
fr: Le basculement auto est activé — désactivez-le pour choisir manuellement
sv: Autoväxling är på — stäng av för att välja manuellt

# easter.audioDaemonStirs
source: The audio daemon stirs.
fr: Le daemon audio s’éveille.
sv: Ljuddemonen rör på sig.

# prefs.footer.millisecondsSaved
source: Milliseconds Saved
fr: Millisecondes économisées
sv: Sparade millisekunder

# prefs.footer.autoSwitches
source: Auto-switches
fr: Basculements auto
sv: Autoväxlingar

# prefs.footer.signalIntegrityScore
source: Signal Integrity Score
fr: Score d’intégrité du signal
sv: Poäng för signalintegritet

# prefs.footer.milestone.tenSeconds
source: You have reclaimed 10 seconds of your life.
fr: Vous avez récupéré 10 secondes de votre vie.
sv: Du har återtagit 10 sekunder av ditt liv.

# prefs.footer.milestone.coffeeBreak
source: You have outlived one coffee break.
fr: Vous avez survécu à une pause-café.
sv: Du har överlevt en kaffepaus.

# prefs.footer.milestone.defeatedInefficiency
source: You have defeated inefficiency.
fr: Vous avez vaincu l’inefficacité.
sv: Du har besegrat ineffektivitet.

# prefs.priority.output.description
source: Drag rows to order preferred output devices. Sentrio activates the top-ranked connected device.
fr: Faites glisser les lignes pour classer les appareils de sortie préférés. Sentrio active l’appareil connecté le mieux classé.
sv: Dra rader för att ordna föredragna utdataenheter. Sentrio aktiverar den högst rankade anslutna enheten.

# prefs.priority.input.description
source: Drag rows to order preferred input devices. Sentrio activates the top-ranked connected device.
fr: Faites glisser les lignes pour classer les appareils d’entrée préférés. Sentrio active l’appareil connecté le mieux classé.
sv: Dra rader för att ordna föredragna indataenheter. Sentrio aktiverar den högst rankade anslutna enheten.

# prefs.priority.section.title
source: Priority order
fr: Ordre de priorité
sv: Prioritetsordning

# prefs.priority.section.hint
source: Grab ≡ to reorder
fr: Saisissez ≡ pour réordonner
sv: Dra ≡ för att ändra ordning

# prefs.disabled.section.title
source: Hidden (not used as fallback)
fr: Désactivés (pas utilisés en secours)
sv: Inaktiverade (används inte som reserv)

# prefs.dragToReorder
source: Drag to reorder
fr: Glisser pour réordonner
sv: Dra för att ändra ordning

# prefs.iconHelp.withCoreAudioFormat
source: CoreAudio icon file: %@ Click to override
fr: Fichier d’icône CoreAudio : %@ Cliquez pour remplacer
sv: CoreAudio-ikonfil: %@ Klicka för att ersätta

# prefs.iconHelp.noCoreAudio
source: Click to change icon
fr: Cliquez pour changer l’icône
sv: Klicka för att ändra ikon

# prefs.renameHelp.output
source: Rename for this output role
fr: Renommer pour ce rôle de sortie
sv: Byt namn för den här utrollen

# prefs.renameHelp.input
source: Rename for this input role
fr: Renommer pour ce rôle d’entrée
sv: Byt namn för den här inrollen

# prefs.disableHelp
source: Disable — remove from auto-switching. Can be re-enabled below.
fr: Désactiver — retirer du basculement auto. Réactivable ci-dessous.
sv: Inaktivera — ta bort från autoväxling. Kan aktiveras igen nedan.

# prefs.removePermanentlyHelp
source: Remove permanently — reappears automatically if device reconnects
fr: Supprimer définitivement — réapparaît automatiquement si l’appareil se reconnecte
sv: Ta bort permanent — visas automatiskt igen om enheten ansluts på nytt

# prefs.removePermanentlyShort
source: Remove permanently
fr: Supprimer définitivement
sv: Ta bort permanent

# prefs.rename.subtitle.output
source: Custom label for this output role only.
fr: Libellé personnalisé uniquement pour ce rôle de sortie.
sv: Anpassad etikett endast för den här utrollen.

# prefs.rename.subtitle.input
source: Custom label for this input role only.
fr: Libellé personnalisé uniquement pour ce rôle d’entrée.
sv: Anpassad etikett endast för den här inrollen.

# prefs.rename.deviceNamePlaceholder
source: Device name
fr: Nom de l’appareil
sv: Enhetsnamn

# prefs.general.enableAutoSwitching
source: Enable auto-switching
fr: Activer le basculement automatique
sv: Aktivera autoväxling

# prefs.general.enableAutoSwitching.description
source: Automatically activates the top-ranked connected device whenever devices connect or disconnect, or when you reorder the priority list.
fr: Active automatiquement l’appareil connecté le mieux classé lorsque des appareils se connectent/déconnectent, ou lorsque vous réordonnez la liste de priorité.
sv: Aktiverar automatiskt den högst rankade anslutna enheten när enheter ansluts eller kopplas från, eller när du ändrar ordning i prioritetslistan.

# prefs.general.visibility
source: Visibility
fr: Visibilité
sv: Synlighet

# prefs.general.hideMenuBarIcon
source: Hide menu bar icon
fr: Masquer l’icône de la barre de menus
sv: Dölj menyradsikon

# prefs.general.hideMenuBarIcon.description
source: When hidden, open Preferences by launching Sentrio again from Launchpad.
fr: Quand elle est masquée, ouvrez Préférences en relançant Sentrio depuis Launchpad.
sv: När den är dold, öppna Inställningar genom att starta Sentrio igen via Launchpad.

# prefs.general.system
source: System
fr: Système

# prefs.general.launchAtLogin
source: Launch at login
fr: Lancer à l’ouverture de session
sv: Starta vid inloggning

# prefs.general.privacy
source: Privacy
fr: Confidentialité
sv: Integritet

# prefs.general.showInputLevelMeter
source: Show live input level meter (Preferences)
fr: Afficher le niveau d’entrée en direct (Préférences)
sv: Visa live-mätare för ingångsnivå (Inställningar)

# prefs.general.showInputLevelMeter.description
source: If enabled, Sentrio monitors the default input device only while Preferences is open. macOS will show the microphone‑in‑use indicator during that time.
fr: Si activé, Sentrio surveille l’appareil d’entrée par défaut uniquement lorsque Préférences est ouvert. macOS affichera l’indicateur micro en cours d’utilisation pendant ce temps.
sv: Om aktiverad övervakar Sentrio standardindataenheten endast när Inställningar är öppet. macOS visar mikrofonindikatorn under den tiden.

# prefs.general.settings
source: Settings
fr: Réglages
sv: Inställningar

# prefs.general.settings.description
source: Export includes priority lists, hidden devices, custom names/icons, and volume memory.
fr: L’export inclut les listes de priorité, les appareils désactivés, les noms/icônes personnalisés et la mémoire des volumes.
sv: Exporten innehåller prioritetslistor, inaktiverade enheter, anpassade namn/ikoner och volymminne.

# prefs.general.volumeMemory
source: Volume Memory
fr: Mémoire des volumes
sv: Volymminne

# prefs.general.volumeMemory.description
source: Volume levels are saved per device and restored automatically when that device becomes active.
fr: Les niveaux de volume sont enregistrés par appareil et restaurés automatiquement quand cet appareil devient actif.
sv: Volymnivåer sparas per enhet och återställs automatiskt när den enheten blir aktiv.

# prefs.language.title
source: Language
fr: Langue
sv: Språk

# prefs.language.system
source: System (Automatic)
fr: Système (Automatique)
sv: System (Automatiskt)

# prefs.language.description
source: Defaults to your macOS language. You can override it here.
fr: Par défaut, utilise la langue de macOS. Vous pouvez la remplacer ici.
sv: Som standard används macOS-språket. Du kan ändra det här.

# prefs.general.about
source: About
fr: À propos
sv: Om

# prefs.general.about.description
source: Sentrio is a lightweight macOS menu bar app for managing audio input and output devices — with automatic switching based on priority rules, per-device volume memory, and live battery display.
fr: Sentrio est une application légère de barre de menus macOS pour gérer les appareils audio d’entrée et de sortie — avec basculement automatique selon des règles de priorité, mémoire de volume par appareil et affichage de la batterie en direct.
sv: Sentrio är en lätt macOS-menyradsapp för att hantera ljudenheter för in- och utdata — med automatisk växling baserat på prioritetsregler, volymminne per enhet och live-batterivisning.

# prefs.general.about.author
source: Author
fr: Auteur
sv: Författare

# prefs.general.about.license
source: License
fr: Licence
sv: Licens

# prefs.window.title
source: Sentrio Preferences
fr: Préférences Sentrio
sv: Sentrio-inställningar

# error.importExport.invalidFile
source: That file doesn’t look like a Sentrio settings export.
fr: Ce fichier ne semble pas être une exportation des réglages Sentrio.
sv: Den filen verkar inte vara en Sentrio-inställningsexport.

# error.importExport.unsupportedSchemaFormat
source: Unsupported settings schema version: %d.
fr: Version de schéma des réglages non prise en charge : %d.
sv: Inställningsschema-versionen stöds inte: %d.

# sound.none
source: None
fr: Aucun
sv: Inget

# sound.systemDefault
source: System default
fr: Par défaut du système
sv: Systemstandard

# transport.builtIn
source: Built-in
fr: Intégré
sv: Inbyggd

# transport.aggregate
source: Aggregate
fr: Agrégé
sv: Aggregat

# transport.virtual
source: Virtual
fr: Virtuel
sv: Virtuell

# transport.unknown
source: Unknown
fr: Inconnu
sv: Okänd

# icon.speaker
source: Speaker
fr: Haut-parleur
sv: Högtalare

# icon.speakerQuiet
source: Speaker (quiet)
fr: Haut-parleur (faible)
sv: Högtalare (tyst)

# icon.speakerLoud
source: Speaker (loud)
fr: Haut-parleur (fort)
sv: Högtalare (högt)

# icon.muted
source: Muted
fr: Muet
sv: Tyst

# icon.hiFiSpeaker
source: Hi-Fi Speaker
fr: Haut-parleur Hi‑Fi
sv: Hi‑Fi-högtalare

# icon.waveform
source: Waveform
fr: Forme d’onde
sv: Vågform

# icon.microphone
source: Microphone
fr: Micro
sv: Mikrofon

# icon.microphoneFilled
source: Microphone (filled)
fr: Micro (plein)
sv: Mikrofon (fylld)

# icon.ear
source: Ear
fr: Oreille
sv: Öra

# icon.headphones
source: Headphones
fr: Casque
sv: Hörlurar

# icon.imacDesktop
source: iMac / Desktop
fr: iMac / Bureau

# icon.displayMonitor
source: Display / Monitor
fr: Écran / Moniteur
sv: Skärm / Monitor

# icon.music
source: Music
fr: Musique
sv: Musik

# icon.builtIn
source: Built-in
fr: Intégré
sv: Inbyggd

# icon.wirelessBt
source: Wireless / BT
fr: Sans fil / BT
sv: Trådlöst / BT

# icon.linkedAggregate
source: Linked / Aggregate
fr: Lié / Agrégé
sv: Länkad / Aggregat

# icon.virtual
source: Virtual
fr: Virtuel
sv: Virtuell

# icon.unknown
source: Unknown
fr: Inconnu
sv: Okänd

# label.volume
source: Volume
sv: Volym
